examples/suite-go/batch-close/mutants/0002-closed-before-it-is-read.diff
diff --git a/batch.go b/batch.go
index 6e83a29..db9ff9b 100644
--- a/batch.go
+++ b/batch.go
@@ -30,8 +30,8 @@ func Total(names []string, open func(string) (*Batch, error)) (int, error) {
 		if err != nil {
 			return n, err
 		}
-		n += b.Size()
 		b.Close()
+		n += b.Size()
 	}
 	return n, nil
 }
