examples/suite-go/config-loader/mutants/0002-value-returned-with-the-error.diff
diff --git a/config.go b/config.go
index 669a9f3..83f0ff8 100644
--- a/config.go
+++ b/config.go
@@ -16,7 +16,7 @@ var ErrMissing = errors.New("config: missing key")
 func Get(m map[string]string, key string) (string, error) {
 	v, ok := m[key]
 	if !ok {
-		return "", fmt.Errorf("%w: %q", ErrMissing, key)
+		return key, fmt.Errorf("%w: %q", ErrMissing, key)
 	}
 	return v, nil
 }
