examples/suite-go/csv-import/mutants/0003-trimmed-before-the-mark.diff
diff --git a/clean.go b/clean.go
index e9d6ac7..d35e1a5 100644
--- a/clean.go
+++ b/clean.go
@@ -9,5 +9,5 @@ import "strings"
 // line endings — from both ends. Whitespace inside the field is left as it
 // is.
 func Clean(s string) string {
-	return strings.TrimSpace(strings.TrimPrefix(s, "\ufeff"))
+	return strings.TrimPrefix(strings.TrimSpace(s), "\ufeff")
 }
