examples/suite-go/inventory-reserve/mutants/0002-refuses-the-whole-stock.diff
diff --git a/reserve.go b/reserve.go
index b363591..89c1382 100644
--- a/reserve.go
+++ b/reserve.go
@@ -6,7 +6,7 @@ package inventory
 // the whole remaining stock is accepted; taking more than there is, or a
 // count that is not positive, is refused and leaves the level alone.
 func Reserve(stock, n int) (int, bool) {
-	if n <= 0 || n > stock {
+	if n <= 0 || n >= stock {
 		return stock, false
 	}
 	return stock - n, true
