examples/suite-go/json-field-tag/mutants/0001-customer-tag-dropped.diff
diff --git a/invoice.go b/invoice.go
index 78a336a..9a513d6 100644
--- a/invoice.go
+++ b/invoice.go
@@ -7,9 +7,9 @@ import "encoding/json"
 // they are lower_snake_case throughout.
 type Invoice struct {
 	Number      string `json:"number"`
-	Customer    string `json:"customer"`
-	AmountCents int64  `json:"amount_cents"`
-	Paid        bool   `json:"paid"`
+	Customer    string
+	AmountCents int64 `json:"amount_cents"`
+	Paid        bool  `json:"paid"`
 }
 
 // Parse decodes one invoice.
