examples/suite-go/ledger-rounding/mutants/0003-add-half-then-floor.diff
diff --git a/rounding.go b/rounding.go
index d3c411f..f80c6f3 100644
--- a/rounding.go
+++ b/rounding.go
@@ -7,5 +7,5 @@ import "math"
 // ToCents converts an amount expressed in currency units into whole cents.
 // A value exactly halfway between two cents rounds away from zero.
 func ToCents(amount float64) int64 {
-	return int64(math.Round(amount * 100))
+	return int64(math.Floor(amount*100 + 0.5))
 }
