examples/suite-go/metrics-counter/mutants/0003-unlocked-too-early.diff
diff --git a/counter.go b/counter.go
index 60f13f5..c5326f6 100644
--- a/counter.go
+++ b/counter.go
@@ -18,7 +18,7 @@ func New() *Counter { return &Counter{n: map[string]int{}} }
 // Inc records one event called name.
 func (c *Counter) Inc(name string) {
 	c.mu.Lock()
-	defer c.mu.Unlock()
+	c.mu.Unlock()
 	c.n[name]++
 }
 
