examples/suite-go/poll-interval/mutants/0002-second-not-minute.diff
diff --git a/interval.go b/interval.go
index b8d9f99..7631c55 100644
--- a/interval.go
+++ b/interval.go
@@ -10,5 +10,5 @@ func Interval(pollsPerMinute int) time.Duration {
 	if pollsPerMinute <= 0 {
 		return 0
 	}
-	return time.Minute / time.Duration(pollsPerMinute)
+	return time.Second / time.Duration(pollsPerMinute)
 }
