examples/suite-go/retry-backoff/mutants/0002-guards-the-wrong-attempt.diff
diff --git a/backoff.go b/backoff.go
index 7a6beb0..421ee62 100644
--- a/backoff.go
+++ b/backoff.go
@@ -8,10 +8,10 @@ import "time"
 // before, up to max. The result is never above max and never below base,
 // however large the caller's attempt number is.
 func Delay(base, max time.Duration, attempt int) time.Duration {
-	d := base
-	for i := 0; i < attempt && d < max; i++ {
-		d *= 2
+	if attempt > 62 {
+		return max
 	}
+	d := base << attempt
 	if d > max {
 		d = max
 	}
