examples/suite-go/usage-share/mutants/0003-fraction-not-percent.diff
diff --git a/share.go b/share.go
index b35c04f..e6b7bd3 100644
--- a/share.go
+++ b/share.go
@@ -7,5 +7,5 @@ func Share(used, total int) float64 {
 	if total == 0 {
 		return 0
 	}
-	return float64(used) / float64(total) * 100
+	return float64(used) / float64(total)
 }
