examples/suite-go/worker-fanout/mutants/0001-one-shared-variable.diff
diff --git a/fanout.go b/fanout.go
index c924d22..912977c 100644
--- a/fanout.go
+++ b/fanout.go
@@ -6,8 +6,9 @@ package fanout
 // outlive this call and are called long after it has returned.
 func Handlers(shards []string) []func() string {
 	out := make([]func() string, 0, len(shards))
+	shard := ""
 	for _, s := range shards {
-		shard := s
+		shard = s
 		out = append(out, func() string { return shard })
 	}
 	return out
